---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Transaction..::..Start Method
Transaction Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Start()()()() | Starts the transaction. |
|  | Start(String) | Starts the transaction with an assigned name. |

# See Also

Transaction Class

Transaction Members

Autodesk.Revit.DB Namespace